logs/20240610-042022-dummy_file.00001663/iodepth=1/rw=read/fio.log
job: (g=0): rw=read, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1
fio-3.35
Starting 1 process

job: (groupid=0, jobs=1): err= 0: pid=86514: Mon Jun 10 04:23:35 2024
  read: IOPS=472, BW=236MiB/s (248MB/s)(10.0GiB/43309msec)
    slat (usec): min=17, max=313, avg=27.53, stdev= 3.36
    clat (usec): min=706, max=84990, avg=2086.69, stdev=3668.58
     lat (usec): min=734, max=85012, avg=2114.23, stdev=3668.71
    clat percentiles (usec):
     |  1.00th=[  709],  5.00th=[  717], 10.00th=[  717], 20.00th=[  734],
     | 30.00th=[  947], 40.00th=[  947], 50.00th=[  955], 60.00th=[  971],
     | 70.00th=[  979], 80.00th=[  979], 90.00th=[ 5604], 95.00th=[10552],
     | 99.00th=[16188], 99.50th=[21103], 99.90th=[35390], 99.95th=[40633],
     | 99.99th=[63701]
   bw (  KiB/s): min=78848, max=519168, per=99.88%, avg=241830.70, stdev=84919.59, samples=86
   iops        : min=  154, max= 1014, avg=472.33, stdev=165.86, samples=86
  lat (usec)   : 750=22.63%, 1000=59.97%
  lat (msec)   : 2=1.96%, 4=3.79%, 10=6.07%, 20=5.00%, 50=0.57%
  lat (msec)   : 100=0.02%
  cpu          : usr=0.14%, sys=1.31%, ctx=20489, majf=0, minf=136
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20480,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=236MiB/s (248MB/s), 236MiB/s-236MiB/s (248MB/s-248MB/s), io=10.0GiB (10.7GB), run=43309-43309msec

Disk stats (read/write):
    md127: ios=29547/26, merge=0/0, ticks=47520/978, in_queue=48498, util=99.53%, aggrios=3714/57, aggrmerge=144/333, aggrticks=6065/1207, aggrin_queue=8240, aggrutil=23.56%
  sdf: ios=3708/51, merge=126/126, ticks=6410/1223, in_queue=8640, util=23.31%
  sdd: ios=3709/50, merge=95/126, ticks=5675/1000, in_queue=7467, util=21.57%
  sdb: ios=3712/51, merge=157/126, ticks=5755/1204, in_queue=7856, util=22.08%
  sdi: ios=3721/61, merge=133/133, ticks=6462/1266, in_queue=8732, util=23.56%
  sdg: ios=3721/65, merge=133/481, ticks=6258/1156, in_queue=8371, util=22.75%
  sde: ios=3724/72, merge=133/890, ticks=5962/1500, in_queue=8692, util=22.76%
  sdc: ios=3715/59, merge=252/662, ticks=5788/1139, in_queue=7817, util=21.83%
  sdh: ios=3708/50, merge=126/126, ticks=6213/1175, in_queue=8347, util=22.90%